Explicacao_das_Medidas.org
#+title: Explicação das medidas
#+author: Gustavo Silveira

-----

SG = Stress group = Grupo acentual

F0 = Frequência fundamental

H1 = Primeiro harmônico

H2 = Segundo harmônico

VV = Intervalo de vogal a vogal

-----

O script extrai medidas prosódicas de *cinco trilhas* de anotação linguística:
- Tons
- Vogais
- Unidades VV
- Pausas
- Chunks

-----

* Camada de tons

** Tipo do tom (/tonetype/)
   
Informa se o tom é do tipo H, L, HL, etc.

*Unidade:* tipos tonais

** Tempo (/time/)
   
Informa a posição temporal do tom na gravação em segundos.

*Unidade:* segundos

** Alinhamento tonal (/alignVV/)

Informa o alinhamento do tom com relação ao início da unidade VV,
dividido pela duração da unidade VV.
   
** F0 média da unidade VV (/meanf0VV/)

Média da F0 da unidade VV em que se encontra o tom.

*Unidade:* Hz

-----

* Camada de vogais

** Vogal (/vowel/)

Indica a vogal.

*Unidade:* vogais da língua

** Diferença entre H1 e H2 (/H1H2/)
   
Indica a diferença de energia entre o primeiro (H1) e o segundo
harmônico (H2) na posição central do intervalo vocálico.

*Unidade:* dB
   
** Pico de Proeminência Cepstral (/CPP/)

O valor em dB do Pico de Proeminência Cepstral na posição central do
intervalo vocálico.

*Unidade:* dB

-----

* Camada de unidades VV

** Delimitação de SG

A partir das unidades VV, o script segmenta automaticamente os grupos acentuais.

** Grau de fronteira

** Número de unidades VV em cada SG (/numberVVunits/)

*Unidade:* unidades VV  
   
** Duração bruta do SG (/stressgroupduration/)

*Unidade:* segundos

** Duração normalizada e filtrada do SG (/finalzfilt/)

*Unidade:* z-score filtrado com média móvel de 5 pontos

-----

* Camada de pausas

** Tipo de pausa (/type/)
** Intervalo entre pausas (/IPI/)
** Duração da pausa (/durSIL/)

-----

* Camada de chunks

-----

** Medidas gerais da F0

*** Mediana da F0 (/f0med/)

*** Desvio padrão da F0 (/f0sd/)

*** Valor mínimo da F0 (/f0min/)

*** Valor máximo da F0 (/f0max/)

*** Semi-amplitude entre quartis (/f0SAQ/)

-----

** Picos de F0

*** Desvio padrão dos picos da F0 (/sdf0peak/)

*** Desvio padrão da largura dos picos da F0 (/sdf0peakwidth/)

*** Taxas de picos da F0 (/f0peak_rate/)

*** Desvio padrão das posições dos picos da F0 (/sdtf0peak/)

-----

** Derivadas de F0

*** Média de F0 da 1a derivada das derivadas positivas (/df0posmean/)

*** Média de F0 da 1a derivada das derivadas negativas (/df0negmean/)

*** Desvio padrão de F0 da 1a derivada das derivadas positivas (/df0sdpos/)

*** Desvio padrão de F0 da 1a derivada das derivadas negativas (/df0sdneg/)

-----

** Qualidade de voz

*** Ênfase espectral (/emph/)

*** Coeficiente de variação de intensidade (/cvint/)

*** LTAS slope between bands 0-1000 Hz and 1000/4000 Hz (/slLTASmed/)

*** LTAS slope between bands 0-1000 Hz and 4000/8000 Hz (/slLTAShigh/)

*** Relação ruído-harmônico (/hnr/)

*** Soft phonation index (/SPI/)

*** Shimmer local (/shimmer/)

*** Jitter local (/jitter/)

-----

** Cadência da fala
   
*** Taxa de elocução (/sr/)

*** Taxa de articulação (/ar/)
